---
kind: method
id: M:Autodesk.Revit.DB.Color.#ctor(System.Byte,System.Byte,System.Byte)
zh: 着色、上色、染色、填色
source: html/d8e0d82c-bb73-5fa3-0950-de74733463d7.htm
---
# Autodesk.Revit.DB.Color.#ctor Method

**中文**: 着色、上色、染色、填色

Constructor that takes the red, green and blue channels of the color.

## Syntax (C#)
```csharp
public Color(
	byte red,
	byte green,
	byte blue
)
```

## Parameters
- **red** (`System.Byte`) - The red channel of the color that ranges from 0 to 255.
- **green** (`System.Byte`) - The green channel of the color that ranges from 0 to 255.
- **blue** (`System.Byte`) - The blue channel of the color that ranges from 0 to 255.